Revit 2020 API
ApplicationEntryPoint Events
The ApplicationEntryPoint type exposes the following members.
Events
Name | Description
ApplicationInitialized
 Subscribe to this event to get notified after the Revit application has been initialized
 (Inherited from Application.)
DocumentChanged
 Subscribe to the DocumentChanged event to be notified when Revit document has changed.
 (Inherited from Application.)
DocumentClosed
 Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
 (Inherited from Application.)
DocumentClosing
 Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
 (Inherited from Application.)
DocumentCreated
 Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document.
 (Inherited from Application.)
DocumentCreating
 Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document.
 (Inherited from Application.)
DocumentOpened
 Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document.
 (Inherited from Application.)
DocumentOpening
 Subscribe to the DocumentOpening event to be notified when Revit is just about to open a document.
 (Inherited from Application.)
DocumentPrinted
 Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
 (Inherited from Application.)
DocumentPrinting
 Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
 (Inherited from Application.)
DocumentSaved
 Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
 (Inherited from Application.)
DocumentSavedAs
 Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
 (Inherited from Application.)
DocumentSaving
 Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
 (Inherited from Application.)
DocumentSavingAs
 Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
 (Inherited from Application.)
DocumentSynchronizedWithCentral
 Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
 (Inherited from Application.)
DocumentSynchronizingWithCentral
 Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
 (Inherited from Application.)
DocumentWorksharingEnabled
 Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared.
 (Inherited from Application.)
ElementTypeDuplicated
 Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
 (Inherited from Application.)
ElementTypeDuplicating
 Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
 (Inherited from Application.)
FailuresProcessing
 Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
 (Inherited from Application.)
FamilyLoadedIntoDocument
 Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
 (Inherited from Application.)
FamilyLoadingIntoDocument
 Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
 (Inherited from Application.)
FileExported
 Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
 (Inherited from Application.)
FileExporting
 Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.
 (Inherited from Application.)
FileImported
 Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API.
 (Inherited from Application.)
FileImporting
 Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.
 (Inherited from Application.)
LinkedResourceOpened
 Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
 (Inherited from Application.)
LinkedResourceOpening
 Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
 (Inherited from Application.)
ProgressChanged
 Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
 (Inherited from Application.)
ViewExported
 Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document.
 (Inherited from Application.)
ViewExporting
 Subscribe to the ViewExporting event to be notified when Revit is just about to export a view of the document.
 (Inherited from Application.)
ViewPrinted
 Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
 (Inherited from Application.)
ViewPrinting
 Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
 (Inherited from Application.)
WorksharedOperationProgressChanged
 Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
 (Inherited from Application.)
See Also
ApplicationEntryPoint Class
Autodesk.Revit.DB.Macros Namespace